package io.mini.i18n.core;

/**
 * 8月23日 12:02
 * <p>
 * 初步理解:
 * 该模块主要是要实现通过对应的properties来进行国际化的一个功能，这里设置对应国家的语言的properties就可以实现对国际化语言功能的替换支持
 * </p>
 *
 * <p>
 * 在这里具体实现已经成型了，所以我们就从接口层面往下进行分析，先从接口入手介绍可能的实现，然后最后再对每个要实现的代码功能进行一个具体的实现，
 * 最终形成一个完整的国际化功能的实现
 * </p>
 * <p>
 * 这一块儿可能整体实现完之后还有一轮具体的分析，主要分析核心功能最后时机的流程，在做一轮整体的总结，以求自己更加的理解，并且会在过程中提出
 * 一些对应的问题，还有对应的一些内容，这些内容如果不理解到时候可以直接去问小马哥，争取把这个功能点彻底的搞懂。
 * </p>
 * <p>
 * 对于问题我们就采用类似<b>问题··问题:这是一个问题</b>的方式来记录，方便后续的查阅与整理。
 * </p>
 */
public class _1_FeatComment {
}
