package io.mini.i18n.spring;

/**
 * <p>
 * 从本部分开始就会涉及到对Spring进行相关的整合，在整合的过程中，可能会涉及到一些前置的
 * 背景知识，这些知识点儿可能会在后续的学习中二次补充，因为在当前的学习过程中，可能会有一些
 * 知识点儿并不是特别的清晰，所以在后期学习并且自己去看Spring的相关源码后，会对这些知识点儿
 * 更加的清楚，到时候在回过头来将这部分的内容补充上也没有问题，并且后续的实现过程中
 * 可能不再是进行一个整体的实现，而是有穿插实现的可能性，这个时候的笔记可能会有一些
 * 不太一样，这里我依然还是按照线性的方式记笔记，对应部分如果用到相关的内容实现，可能
 * 只会先构建对应的类和方法，并不实际实现里面的内容，内容实现则是按照对应的进度不断的去
 * 进行对应的完善。
 * </p>
 * <p>
 *  对于这个云原生的内容由于和其他内容也有一定的关联性，因此整体的学习过程可能会比较长，
 *  并且还会有不同的穿插，所以属于一个长期学习的过程，中途可能会有其他学习内容的穿插，
 *  比如其他训练营当中的内容，当前如果有相关的穿插主要还是以大模型相关的实践项目为主
 *  而不是其他的内容，毕竟大模型相关的内容应该在后续的工作中会有比较多的应用场景
 *  和落地的可能性。
 * </p>
 */
public class _1_Chore {
}
